ps/app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Noodles"], ["user_id", 1], ["created_at", "2018-10-22 18:17:01.957137"], ["updated_at", "2018-10-22 18:17:01.957137"]]
---
  def create
    @category = Category.new(category_params)
    @category.user_id = current_user.id
    respond_to do |format|
      if @category.save