ps/app/controllers/dishes_controller.rb

    def set_dish
      @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]