ps/app/controllers/stalls_controller.rb

  def index
    @stalls = Stall.all
---
SELECT "stalls".* FROM "stalls"

  def new
    @stall = Stall.new
    if current_user.admin?
      @owners = User.all
    elsif current_user.stall?
      @owners = User.where(id: params[:owner])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_sowner
      @sowner = User.find(@stall.owner)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]