ps1/app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"

  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save
---
INSERT INTO "assignments" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2018-08-30 09:40:38.865270"], ["updated_at", "2018-08-30 09:40:38.865270"]]

    def set_assignment
      @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]