ps1/app/controllers/basics_controller.rb

SELECT DISTINCT "quotations"."category" FROM "quotations"
INSERT INTO "quotations" ("author_name", "category", "quote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "Rounak"], ["category", "mo"], ["quote", "raj naam toh sunna he hoga "], ["created_at", "2018-09-12 06:58:40.732293"], ["updated_at", "2018-09-12 06:58:40.732293"]]
SELECT "quotations".* FROM "quotations" WHERE (lower(quote) LIKE '%') ORDER BY "quotations"."created_at" ASC
SELECT "quotations".* FROM "quotations" ORDER BY "quotations"."created_at" ASC
---
	def quotations

		@categories = Quotation.distinct.pluck(:category)
		if params[:quotation]
			if params[:ncategory]
				params[:catagory] = params[:ncategory]
			end
				@quotation = Quotation.new( params.require(:quotation).permit(:author_name, :category, :quote) )

			if @quotation.save
				flash[:notice] = 'Quotation was successfully created.'
				@quotation = Quotation.new
				redirect_to basics_quotations_path
			end
		else
			@quotation = Quotation.new
		end
#SORT BY DATE AND CATEGORY
		if params[:sort_by] == "date"
			if params[:keyword]
				@quotations = Quotation.where("lower(quote) LIKE :search OR lower(author_name) LIKE :search", search: "%#{params[:keyword]}%").all.order(:created_at)
			# elsif params[:keyword]
			# 	@quotations = Quotation.where("lower(author_name) LIKE ?", "%#{params[:keyword]}%").all.order(:created_at)
			# else
				@quotations = Quotation.where.not(id: get_killed).order(:created_at)

SELECT "quotations".* FROM "quotations" WHERE "quotations"."id" NOT IN (SELECT "quotations"."id" FROM "quotations" WHERE "quotations"."id" NOT IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23)) ORDER BY "quotations"."category" ASC
SELECT "quotations".* FROM "quotations" ORDER BY "quotations"."category" ASC
---
		else
# SEARCH CONDITION
			if params[:keyword]
					@quotations = Quotation.where("lower(quote) LIKE :search or lower(author_name) LIKE :search", search: "%#{params[:keyword]}%").all.order(:category)
				# elsif params[:keyword]
				# 	@quotations = Quotation.where("lower(author_name) LIKE ?", "%#{params[:keyword]}%").all.order(:category)
			else
				@quotations = Quotation.where.not(id: get_killed).order(:category)

SELECT "quotations".* FROM "quotations"
---
	def set_quotations
      # setting quotations and quotation vars
	    killed_ids = []
	    if cookies[:kid]
		    killed_ids = cookies[:kid].split(',')
		end
		killed_ids = killed_ids.map do |x|
			x.to_i
		end

      	if killed_ids.blank?
        	@quotations = Quotation.all

SELECT "quotations".* FROM "quotations"
---
	def export_xml

		@quo = Quotation.all

SELECT "quotations".* FROM "quotations"
---
    def export_json

		@quo = Quotation.all

INSERT INTO "quotations" ("author_name", "category", "quote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "George Lucas"], ["category", "Movies"], ["quote", "Do, or do not, there is no try."], ["created_at", "2018-09-09 20:23:36"], ["updated_at", "2018-09-09 20:23:36"]]
---
	def import_quotations
    	if params[:upload]
    		urll = params[:upload]

    	end

    		xml = params[:upload].read # if your xml is in the 'data.xml' file
			xml_hash = Hash.from_xml(xml)['objects']
			logger = Logger.new STDOUT
			logger.info xml_hash


			xml_hash.each do |x|
				quotation = Quotation.new
				quotation.author_name = x["author_name"]
				quotation.category = x["category"]
				quotation.quote = x["quote"]
				quotation.created_at = x["created_at"]
				quotation.updated_at = x["updated_at"]
			quotation.save