ps/app/views/stalls/index.html.erb

        <td><%= stall.desc %></td>
        <td><%= User.find(stall.owner).email %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]