pbs/app/controllers/basics_controller.rb

	def quotations

		@categories = Quotation.distinct.pluck(:category)
---
SELECT DISTINCT "quotations"."category" FROM "quotations"

		else

			if params[:keyword]
					@quotations = Quotation.where("lower(quote) LIKE :search or lower(author_name) LIKE :search", search: "%#{params[:keyword]}%").all.order(:category)
---
SELECT "quotations".* FROM "quotations" WHERE (lower(quote) LIKE '%milk%' or lower(author_name) LIKE '%milk%') ORDER BY "quotations"."category" ASC

	def set_quotations
      # setting quotations and quotation vars
	    killed_ids = []
	    if cookies[:kid]
		    killed_ids = cookies[:kid].split(',')
		end
		killed_ids = killed_ids.map do |x|
			x.to_i
		end

      	if killed_ids.blank?
        	@quotations = Quotation.all
---
SELECT "quotations".* FROM "quotations"

    def import_quotations
    	if params[:upload]
    		urll = params[:upload]

    	end

    		xml = params[:upload].read # if your xml is in the 'data.xml' file
			xml_hash = Hash.from_xml(xml)['objects']
			logger = Logger.new STDOUT
			logger.info xml_hash


			xml_hash.each do |x|
				quotation = Quotation.new
				quotation.author_name = x["author_name"]
				quotation.category = x["category"]
				quotation.quote = x["quote"]
				quotation.created_at = x["created_at"]
---
INSERT INTO "quotations" ("author_name", "category", "quote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "Unknown "], ["category", "Movie"], ["quote", "I feel like those Jewish people in Germany in 1942."], ["created_at", "2018-09-11 07:51:56"], ["updated_at", "2018-09-11 07:51:56"]]